Revit 2027 API
BuiltInFailures.ZoneFailures Class
 Failures about Zone.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ZoneFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ZoneFailures
Public NotInheritable Class ZoneFailures
public ref class ZoneFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ZoneFailures = class end
The BuiltInFailures.ZoneFailures type exposes the following members.
Properties
Name | Description
ZoneExistsNotEnclosedRoom |  Zone has a room not enclosed.
ZoneNotEnclosed |  Zone not enclosed totally.
ZonesOverlapWarning |  Zone overlap to another zone or another room.
Top
See Also
Reference
Autodesk.Revit.DB Namespace